// ...1 Գրել կոդ, որը  console  պատուհանում տպի Ձեր Անուն Ազգանունը և Alert անի My First Homework արտահայտությունը:
console.log('VahagnStepanyan');
alert('My First Homework');



// ...2 Գրել կոդ որը աշխատացնելուց հետո  երեք անգամ բացում է prompt պատուհանը և այցելուն այդ պատհուններից առաջինում գրում է անունը, երկրորդում տարիքը, 
// իսկ երրորդում իր քաղաքը, որից հետո alert  է լինում հետևյալ արտահայտությունը՝
// My name is ՙՙմուտքագրված անունը՚՚ i am ՙՙմուտքագրված տարիքը՚՚ old. I am from ՙՙմուտքագրված քաղաքը՚՚

let name = prompt('Name?', 'Vahagn');
let age = +prompt('age?', 23);
let city = prompt('city', 'Aparan');
alert('My name is ' + name + ' i am ' + age + ' old. I am from ' + city);



// ...3 Գրել կոդ , որը կստուգի prompt-ով տրված թիվը 8-20 միջակայքում  է, թե ոչ: Console-ում  տպի true եթե ճիշտ է և false եթե սխալ է:
let num = +prompt('num is ', 12);
if(num > 8 && num < 20){
    console.log('true');
} else{
console.log('false');
}



// ...4 console.log(undefined || 0 || null || true && "0" && " " && 5 || 9) Կոդը տեղադրել script-ում 
// և գրել մեկնաբանություններ այս  գործողությունների արդյունքի մասին   և ինչու է այդպես:

Կրճատելով ստանում ենք այս տեսքը (console.log(undefined || 0 || null || 5 || 9) // 5։), 
և կամ անելով հերթով առաջին արժեքը 5-ն է, միանգամից տպում է դա։ Եթե 5ից առաջ գրենք օրինակ 4, կվերադարձնի 4, ոչ թե 5:

onsole.log(undefined || 0 || null || true && "0" && " " && 4 || 5 || 9) // 4:



// ...5 Ներքոնշյալ կոդը տեղադրել script-ում և գրել մեկնաբանություններ այս  գործողությունների արդյունքները  ըստ տողերի և ինչու է այդպես

console.log("" + 1 + 0)      // '10' Քանի որ սկզբում string է գումարվում, դրա համար ամբողջը դառնում է string։

console.log(true + false)    // 1 true === 1, իսկ false === 0, գումարը հավասար է 1։

console.log("2" * "3")       // 6 Բազմապատկման դեպքում երկու string-երը միացնում է իրար, իսկ մեջի արժեքները բազմապատկում։

console.log("$" + 4 + 5)     // '$45' Քանի որ սկզբում string է գումարվում, դրա համար ամբողջը դառնում է string։

console.log("4px" - 2)       // NaN  Բինարի - նշանը կատարում է մաթեմատիկական գործողություն, իսկ string-ից հանած number === NaN:

console.log(null + 1)        // 1  null + 1 === 1:

console.log(undefined + 1)   // NaN undefined սահմանված չէ, հետևաբար բինարի + նշանը անւոմ է մաթեմատիկական գործողություն, իսկ հետևանքը` NaN, ոչ թվին գումարում է թիվ, արդյունքը թիվ չէ։

console.log("apple" > "pineapple")  // false 'a' մեծ է քան 'p', այսինքն տառերի ինդեղսները ըստ դասավորվածության առաջ ու հետ են։

console.log("2" > "12")             // true Այստեղ էլ 2 մեծ է 1-ից, դրա համար true։

